[
  {
    "name": "Amazon",
    "role": "SDE 2",
    "from": "Sep 2021",
    "to": "Present",
    "location": "Banglore, IN",
    "details": [
      "Working with the UPI Platform team on different intiatives",
      "Working on the ODR platform for UPI payment in amazon pay application",
      "Implemented independent intiative to ease operation load in the team by automating some of the manual processes"
    ]
  },
  {
    "name": "BrowserStack",
    "role": "Senior Software Engineer",
    "from": "May 2019",
    "to": "Aug 2021",
    "location": "Mumbai, IN",
    "details": [
      "Built integration with Puppeteer and Playwright in distributed DC setup on BrowserStack from ground up.",
      "Created in-house framework for documentation which reduced the deploy cycle from 2-4 days to 10-15 minutes.",
      "Individual Contributor and Owner of Screenshots and Responsive Product offering.",
      "Built systems that serves more than 50+ million requests in a day to support testing at scale."
    ]
  },
  {
    "name": "Shipsy",
    "role": "Software Developer Intern",
    "from": "Jan 2019",
    "to": "April 2019",
    "location": "Gurugram, IN",
    "details": [
      "Worked on the team responsible for creating the first EXIM (Export Import Module) in the company.",
      "Created and Deployed serverless function to generate excel sheets and extensible for use-case in other projects as well.",
      "Created application for the unified shipment tracking system from ground up."
    ]
  },
  {
    "name": "Google",
    "role": "Google Summer of Code",
    "from": "May 2018",
    "to": "Aug 2018",
    "location": "Gurugram, IN",
    "details": [
      "Created platform to generate and customize badges for events.",
      "Integrated Cloud functions for automating tasks like sending notification, emails.",
      "Added badge customization features and refactored backend for modularity following SOLID principles.",
      "Created Admin interface and analytics dashboard for managing the site functionality."
    ]
  }
]
