[
  {
    "name": "Amazon",
    "role": "SDE 2",
    "from": "Sep 2021",
    "to": "Present",
    "location": "Banglore, IN",
    "details": [
      "I worked with the UPI Platform team on multiple initiatives that helped drive business growth and improve operational efficiency.",
      "Implemented offline services that significantly reduced infrastructure costs by 80%, thereby optimizing resource allocation and improving overall financial health.",
      "As part of a separate project, I developed and successfully deployed real-time dispute resolution capabilities for UPI payments on AmazonPay, resulting in reductions in customer inquiries by 70% related to pending transactions and substantially enhancing the overall customer experience.",
      "Identified opportunities to streamline operations by improving monitoring of E2E services, which led to a notable decrease in high-severity tickets by 60%, thereby reducing the operational load and enhancing overall service delivery."
    ]
  },
  {
    "name": "BrowserStack",
    "role": "Senior Software Engineer",
    "from": "May 2019",
    "to": "Aug 2021",
    "location": "Mumbai, IN",
    "details": [
      "In a distributed data center setup on BrowserStack, I built integrations with Puppeteer and Playwright from scratch, enabling seamless collaboration. This was an industry first project and didn't existed in the industry at that time.",
      "To enhance efficiency, I created an internal framework for documentation that streamlined our deploy cycle, reducing it from 2-4 days to just 10-15 minutes.",
      "As an individual contributor and owner of the Screenshots and Responsive Product offering, I took ownership of its development and maintenance.",
      "By designing scalable systems, I successfully supported testing at scale, handling more than 50 million requests per day"
    ]
  },
  {
    "name": "Google",
    "role": "Google Summer of Code",
    "from": "May 2018",
    "to": "Aug 2018",
    "location": "Gurugram, IN",
    "details": [
      "I worked on the project to create a new feature that would allow users to generate and customize badges for events.",
      "Developed and deployed the integration with Cloud functions into the system to automate some user-facing workflows.",
      "Developed and deployed the badge customization features and refactored the backend to make it more modular, ensuring that it adhered to SOLID principles.",
      "Worked on creating an Admin interface and analytics dashboard for managing site functionality."
    ]
  }
]
