[
  {
    "name": "Amazon",
    "role": "SDE 2",
    "from": "Sep 2021",
    "to": "Present",
    "location": "Gurugram, IN",
    "details": [
      "I am working with UPI Platform team on multiple initiatives that are helping drive business growth and improve operational efficiency.",
      "Implemented offline services that significantly reduced infrastructure costs by 80%, thereby optimizing resource allocation and improving overall cost.",
      "Developed and deployed a real-time dispute resolution capabilities for UPI payments on AmazonPay, resulting in reductions in customer inquiries by 70% related to pending transactions.",
      "Identified opportunities to streamline operational excellence by improving monitoring of E2E services, which led to a notable decrease in high-severity tickets by 60%."
    ]
  },
  {
    "name": "BrowserStack",
    "role": "Senior Software Engineer",
    "from": "Sep 2020",
    "to": "Sep 2021",
    "location": "Mumbai, IN",
    "details": [
      "Designed and Developed industry first integration of Puppeteer and Playwright on Grid setup from ground up.",
      "Built a highly-available websocket reverse proxy to maintain the customer session with backend servers in Nodejs and deployed it in production.",
      "Built the service to build real time interaction with test device with the help of leveraging WebRTC stack."
    ]
  },
  {
    "name": "BrowserStack",
    "role": "Software Engineer",
    "from": "May 2019",
    "to": "Sep 2020",
    "location": "Mumbai, IN",
    "details": [
      "Built an internal framework for documentation that reduced the time to ship from 2 days to just 15 minutes and enhanced the productivity of Product Managers.",
      "Acted as an Individual contributor and owner of the Screenshots and Responsive product offering, was handling the customer tickets and development for the product.",
      "Designed and deployed scalable system that were handling more than 50 million requests per day."
    ]
  },
  {
    "name": "Shipsy",
    "role": "Software Engineer Intern",
    "from": "Jan 2019",
    "to": "April 2019",
    "location": "Gurugram, IN",
    "details": [
      "Designed and Built Serverless function for a custom document builder service in Excel format for reports in AWS.",
      "Built the internal service availability dashboard and deployed it in production.",
      "Designed and built unified container tracking system, which helped in securing the pilot run with Reliance corporation.",
      "Built backend for a new product offering using typescript and Nestjs"
    ]
  },
  {
    "name": "Google",
    "role": "Google Summer of Code Fellowship",
    "from": "May 2018",
    "to": "August 2018",
    "location": "Remote",
    "details": [
      "I worked on the project to create a new feature that would allow users to generate and customize badges for events.",
      "Developed and deployed the integration with Cloud functions into the system to automate some user-facing workflows.",
      "Developed and deployed the badge customization features and refactored the backend to make it more modular, ensuring that it adhered to SOLID principles.",
      "Worked on creating an Admin interface and analytics dashboard for managing site functionality."
    ]
  }
]